unit Chinese2Pinyin;

interface
            
  function GetChinese2PinYinHeader(AChineseString: WideString): AnsiString;

implementation

uses
  Sysutils;

const
  ChineseCharExCount = 36;
  ChineseCharEx: array[0..ChineseCharExCount - 1] of WideString = (
    'ис', 'пІ', 'ть',
    '№–', 'жя', 'яЅ', 'ой', 'Ё…', 'зЌ',  
    'фщ', '№ ',
    'чм', 'фъ', 'яб', 'я∞', 'Ё–', 'с∞', 'а§', 'сЉ',   
    'Ё≠',      
    'яї', '№т',   
    '№’', 'лх', 'о№', 'л“', 'я…', 'л„', 'иџ',  
    'хъ', 'Џ≠', 'зъ', 'с•', '№о', '№ц', 'ёљ'
  );

  ChinesePinyinHeaderEx: array[0..ChineseCharExCount - 1] of AnsiChar = (
    'A', 'A', 'A',
    'B', 'B', 'B', 'B', 'B', 'B',
    'C', 'C',
    'D', 'D', 'D', 'D', 'D', 'D', 'D', 'D',
    'E',
    'F', 'F',
    'G', 'G', 'G', 'G', 'G', 'G', 'G',    
    'H', 'H', 'H', 'H', 'H', 'H', 'H'
  );

function GetChinese2PinYinHeaderEx(AChineseChar: WideChar): AnsiChar;
var
  i: integer;
begin
  Result := #0;
  for i := Low(ChineseCharEx) to High(ChineseCharEx) do
  begin
    if AChineseChar = ChineseCharEx[i] then
    begin
      Result := ChinesePinyinHeaderEx[i];
      Exit;
    end;
  end;
//  case AChineseChar of
//    'тї': Result := 'J';
//    'й»': Result := 'J';
//    'л¬': Result := 'J';
//    'жЇ': Result := 'J';
//    'а≠': Result := 'K';
//    'Ў—': Result := 'K';
//    'ує': Result := 'L';
//    'ц¶': Result := 'L';
//    'з–': Result := 'L';
//    'т√': Result := 'L';
//    'ё§': Result := 'L';
//    'яш': Result := 'L';
//    'мҐ': Result := 'L';
//    'с™': Result := 'L';
//    'Ёє': Result := 'L';
//    '№я': Result := 'L';
//    'у°': Result := 'M';
//    'ч©': Result := 'M';
//    'тъ': Result := 'M';
//    'ЁЃ': Result := 'M';
//    'яд': Result := 'M';
//    'а„': Result := 'M';
//    '№‘': Result := 'M';
//    'ЁЅ': Result := 'N';
//    'аЂ': Result := 'N';
//    'ле': Result := 'N';
//    'яя': Result := 'P';
//    'иЋ': Result := 'P';
//    'гъ': Result := 'P';
//    'с±': Result := 'P';
//    'а—': Result := 'P';
//    'зк': Result := 'P';
//    'иЅ': Result := 'P';
//    'цƒ': Result := 'Q';
//    'ф«': Result := 'Q';
//    'аЇ': Result := 'Q';
//    '№ќ': Result := 'Q';
//    'иљ': Result := 'Q';
//    '№с': Result := 'Q';
//    '№Ћ': Result := 'Q';
//    'мо': Result := 'Q';
//    'џѕ': Result := 'Q';
//    'ч„': Result := 'R';
//    'чк': Result := 'S';
//    'ци': Result := 'S';
//    //'чк': Result := 'S';
//    'аз': Result := 'S';
//    'рр': Result := 'S';
//    'лƒ': Result := 'T';
//    'ўҐ': Result := 'T';
//    'лњ': Result := 'W';
//    'х£': Result := 'X';
//    //'х£': Result := 'X';
//    'цќ': Result := 'X';
//    'хѓ': Result := 'X';
//    'ч®': Result := 'X';
//    'е–': Result := 'X';
//    'з”': Result := 'X';
//    '№∞': Result := 'X';
//    '№Ї': Result := 'X';
//    'де': Result := 'X';
//    'фи': Result := 'Y';
//    'цЄ': Result := 'Y';
//    'я≈': Result := 'Y';
//    'вщ': Result := 'Y';
//    'йЏ': Result := 'Y';
//    'еы': Result := 'Y';
//    'х•': Result := 'Z';
//    //'х•': Result := 'Z';
//    'х≈': Result := 'Z';
//    'ят': Result := 'Z';
//    'уѓ': Result := 'Z';
//    'у√': Result := 'Z';
//    //'уѓ': Result := 'Z';
//    'фч': Result := 'Z';
//    'зё': Result := 'Z';
//    'а©': Result := 'D';
//    'йЂ': Result := 'Z';
//    'Ёб': Result := 'B';
//    'йё': Result := 'B';
//    'Зf': Result := 'E';
//    '№љ': Result := 'F';
//    'Яh': Result := 'J';
//    'йў': Result := 'J';
//    'у™': Result := 'P';
//    'ф»': Result := 'S';
//    'Лq': Result := 'T';
//    'рц': Result := 'Y';
//    'Ж®': Result := 'Z';
//    '∞Y': Result := 'Z';
//    'иў': Result := 'Z';
//    'лк': Result := 'Z';
//
//
//    'яє', 'пє', 'аƒ', 'пЌ', 'ёя', 'а»', 'ц∞', 'нЅ', 'а…', 'ж»', 'к”', 'и®', {'ис',}
//    'в÷', 'Џѕ', 'р∆', 'џы', {'пІ',} 'ёо', 'бн', 'чц', 'џк', 'аї', 'вЏ', 'йб', 'еџ',
//    'съ'{, 'ть'}, 'ч°', 'чй', 'жЅ', 'бЃ', 'жс', 'цЋ'{, 'вЏ'}:
//    Result := 'a';
//
//    'б±', 'фќ', '№Ў', 'Ё√', 'ч…', 'ц—', 'е±', 'кю', 'ёг', 'я¬', 'с£', 'с≠', 'Џж',
//    'џа', 'о”', 'ф≤', 'дЇ', 'Ёт', 'ўи'{, 'жя'}, 'м“', 'цµ', 'р±'{, 'Ёб'}, 'сў', 'хј',
//    'Џй', 'р«', 'Џэ', 'г£', 'н’', 'Ён', 'сЎ', 'чє', 'цЌ', 'кЏ', 'пЉ', 'џќ', 'џ–',
//    'а‘', 'кі', 'Ё©', 'Ў∞'{, 'яЅ'}, 'ею', 'пх', 'ў¬', 'ф∞', 'оѓ', 'яў', '№к', 'бщ'{,
//    'ой'}, 'жЊ', 'вЎ'{, 'Ё…'}, 'ец', 'гє', 'уў', 'дд', 'с‘', 'хѕ', 'ул', 'ж‘', 'уч',
//    'ёµ', 'е®', 'ч¬', 'иµ', 'ф≈', 'нЊ', 'у÷', 'м‘', 'тщ', 'цэ', 'сє', 'Ў“', 'н№',
//    'сџ', 'џЌ', 'вн', 'гк'{, '№–'}, 'з¬', 'м©', 'ч‘', 'жф', 'с¶', 'пЏ', 'м≠', 'мЃ',
//    'пр', 'жї', 'с—', 'чІ', 'хњ', 'ўѕ'{, 'зЌ'}, 'йƒ', 'пў', 'бў', 'йл', 'лч', 'ч∆',
//    'чё', 'Џы', 'ўч', 'ёр', 'вƒ', 'а£', 'Ў√', 'ўс', 'оа', 'рЊ', 'хџ', 'нз', 'хЋ',
//    'ф§', 'лҐ'{, 'йё'}, 'еЌ', 'оя', 'кќ', 'х≥', 'я≤', 'о–', 'к≥', 'зг', 'е≤', 'рЏ':
//    Result := 'b';
//
//    'ак', 'не', 'жо', 'чх', 'ф”', 'и≤', 'Ўч', 'а–', 'до', 'фљ', 'у©', '№≥', 'вь',
//    'бѓ', 'дє', 'аб', 'иЊ', 'в«', 'п ', 'в™', 'йґ', 'йя', 'с√', 'пп', 'гв', 'ж±',
//    'оќ', 'ў≠', 'т≤', 'ры', 'ки', 'жњ', 'ео', 'мш', 'в№', 'дэ', 'пв', 'уЄ', 'хр',
//    'Џ∆', 'Ёџ', 'ўж', 'вг', 'ес', 'Ўц', 'жљ', 'Ё≈', 'г—', 'цр', '№…', 'бд', 'жѕ',
//    'к∆', 'гЃ', 'л©', 'вк', 'џЋ', 'вч', 'мћ', 'кЋ', 'сй', 'нЇ', 'еш', 'џе', 'ё”',
//    'и°', 'аЅ', 'еЈ', 'Џ»', 'н„', 'ц≥', 'йі', 'Џя', 'ия', 'т…', 'ох', 'о™', 'Ў©',
//    'и«', 'џф', 'ос', 'сќ', 'лу', 'х®', 'як', 'тњ', 'рЈ', 'нч', 'у„', 'аЌ', 'ж ',
//    'у§', 'чќ', '№Ё', '№ѓ', 'хЎ', 'уш'{, 'фщ'}, 'сЁ', 'б№', 'я≥', 'вЅ', 'лЈ', 'аі',
//    'ў—', 'с°', 'вз', '№ы', 'ф©', 'гњ', 'фЊ', 'п•', 'сђ', 'ў±', 'аь', 'г∞', 'ц≈',
//    'йЋ', 'џї', 'т№', 'хй', 'и∆', 'иъ', 'с“', 'Ў°', 'вр', 'з©', 'гј', 'чн', 'ёх',
//    'а®', 'а№', 'хя', 'зЁ', 'л∞', 'ф≠', 'е„', 'вґ', 'оЋ', 'вл', 'Џп', 'йҐ', 'й≥',
//    'тн', 'Ёї', 'р»', 'х÷', 'к°', 'цЇ', 'яЏ', 'мф', '№л', 'рЋ', 'фў'{, '№ '}, 'и»',
//    'жх', 'иЃ', 'д»', 'зэ', 'й®', 'лн', 'к£', 'бё', 'йг', 'вІ', 'Ёэ', 'хЊ', 'хн',
//    'ўџ', 'ўа', 'я•', 'пй', 'ма', 'йЅ', 'и≠', 'яэ', 'г≤', 'ЁЌ', 'л•', 'се', 'вв',
//    'хг', 'бѕ', 'ро', 'пу', 'хЇ', 'лв', 'Ў»', 'п±', 'лъ', 'е§', 'жц':
//    Result := 'c';
//
//    'я’', 'ё«', 'а™', 'с„', 'жІ', 'вт', 'уќ', 'ч∞', 'ч≤', 'бЈ'{, 'я∞'}, 'з™', 'е ',
//    'зй', '№§'{, 'чм'}, 'нс', 'сх', 'йй', 'рч', 'ум', 'ўў', 'рг', 'аҐ', 'Ёћ', 'е£',
//    'с…', 'Џ‘', 'џ ', 'еі', 'нЄ'{, 'Ё–'}, 'яґ', 'вб', 'лЃ', 'фо', 'пљ', 'ав', 'ф£',
//    'к≠', 'бЎ', 'нг', 'пл', 'ф∆', 'а÷', 'пб', 'ўб', 'Ёґ', 'кл', 'Ўµ', 'ЏЃ', 'џ°',
//    'џж', 'и№', 'н∆', 'чЊ', 'жЈ', 'Џ–', 'й¶', 'ны', 'нЏ', 'а«', 'бџ', 'с≤', 'хЏ',
//    'Џз', 'џг', 'зи', 'од'{, 'с∞'}, 'ф°', 'хх', 'цф', 'оц', 'џм', 'рђ', '№¶', 'ёй',
//    'су', 'лЇ', 'хё', 'цш', 'Ўк', 'за', 'рџ', 'сф'{, 'фъ'}{, 'а§'}, 'лл', 'н÷', 'оы',
//    'яЋ', 'бі', 'л±', 'рі', 'џн', 'бЉ', 'лЋ', 'лЎ', 'нѕ', 'Ёъ', 'уы', 'тљ'{, 'сЉ'},
//    'аљ', 'д¬', 'иь', 'лє', 'чт', 'ч«', 'у∆', '№ґ', 'уЉ', 'й≤', 'м—', 'уэ', 'н°',
//    'н‘', 'н≠', 'пж', 'нв', 'нп', 'хї', 'гз', 'мј', 'нї', 'яЌ', 'с÷', 'ом', 'хв'{,
//    'яб'}, 'зґ', 'гх', 'Џа', 'Ўй', 'кж', 'пҐ', 'оЃ', 'оъ', 'вЇ', 'ЎЉ':
//    Result := 'd';
//
//    'ен'{, 'Ё≠'}, 'п∞', 'жє', 'яј', '№√', 'йо', 'џ—', 'Џћ', 'г’', 'гµ', 'Ёа', 'лс',
//    'п…', 'р ', 'т¶', 'Ўђ', 'цщ', 'Ём', 'ёф', 'рє', 'ц№', 'е«', 'зн', 'оп', 'ў¶',
//    'а≈', 'ян', 'Џј':
//    Result := 'e';
//
//    'џ“', 'нј', 'б¶', 'ёђ', 'м№', 'хм', 'ёј', 'о≤', 'иу', 'Џъ', 'и ', 'о’', 'ц–',
//    'ф≥', 'еъ', 'з≥', 'мй', 'тг', 'ц≠', 'цо', 'д«', 'ли', 'г≠', 'м≥', 'йЉ', 'фд',
//    'ух', 'бф', 'рт', 'п–', 'иы', 'чч', 'ў«', 'цч', 'еѓ', 'гг', 'нњ', 'Ё„', 'џЇ',
//    'яф', 'ўЇ', 'уЊ'{, 'яї'}, 'х√', 'фп', 'пы', 'х∆', 'ўм', 'жЏ'{, '№љ'}, '№ј', 'вц',
//    'з¶', 'з®', '№ё', 'мр', 'оЈ'{{, '№т'}, 'џЃ', 'н…', 'Ё≥', 'тґ', 'ўл', 'их', 'ех',
//    'Ё ', 'тЁ', 'б•', 'тр', 'нк', 'ё‘', 'дж', 'нл', 'жв', 'ц÷', 'кз', 'ту', 'цы',
//    'р•', 'лґ', 'бл':
//    Result := 'f';
//
//    'кЄ', 'ў§', 'о≈', 'жў', 'жЎ', 'ёќ', 'Џл', 'џт', 'ка', 'Ў§', 'кЃ', 'џб', 'гп'{,
//    '№’'}, 'рб', 'фы', 'ёѕ', 'дч', 'йѕ', 'я¶', 'кЇ', 'нЈ', 'з§', 'д∆', 'оЄ', 'уа',
//    'н∞', 'йј', 'ЎЇ', 'кљ', 'з…', 'й¬', 'ёї', 'ЏЊ', 'џђ', 'пѓ', 'џў', 'жь', 'сЋ',
//    'Ў™', 'а√', '№™', 'л°'{, 'лх'}, 'п”', 'чј', 'џЅ', 'фі', 'ті', 'н—', 'яз', 'Ў®',
//    'фё', 'ЁҐ', 'вў', 'ям', 'зЃ', 'цб', 'л≈', 'тЉ', 'ц°', 'зо', 'Ўю', 'з√', 'уф',
//    'чЄ', 'бЄ'{, 'иџ'}, 'у—', 'ЏЄ', 'ж≈', 'м∞', 'е№', 'кн', 'йп', 'р≥', 'Ё‘', 'тЅ',
//    'хэ', 'фю', 'м±', 'чљ', 'гй', 'Џђ', 'кф', 'оє'{, 'о№'}, 'Ў≈', 'лы', 'о≠', 'бƒ',
//    'иф', 'кц', 'ру', 'пј', 'цс'{, 'л“'}, 'рї'{, 'я…'}, 'Ў‘', 'Џі', 'ўƒ', 'ч§', 'ёи',
//    'д ', 'о¬', 'рў', 'яџ', 'иж'{, 'л„'}, 'бо', 'ж£', 'рІ', 'цў', 'е≥', 'в—', 'Ў–',
//    'к–', 'ую', 'Ўџ', 'кЅ', 'чђ', 'ўт', 'зµ', 'нё', 'цз', 'я√', 'џц', 'б∆', 'сш',
//    'те', 'аю', 'ёв', 'лљ', 'ўе', 'в£', 'й§', 'тд', 'ин', 'ЁЄ', 'я»':
//    Result := 'g';
//
//    'рј', 'ою', 'аЋ', 'л№', 'х∞', 'сь', 'тј', 'чэ', 'Џх', 'кѕ', 'м ', 'Ё’', 'т•',
//    'ёю', 'еЂ', 'зђ', 'сю', 'гм', 'Ёп', 'аг', 'ёґ', 'тЇ', 'а∆', 'е©', 'кї', 'р©',
//    'тЂ', 'е∞'{, 'Џ≠'}, 'ај', 'џј', 'к¬', 'оЅ', 'тҐ', 'гЎ', 'фз', 'џ÷', 'им', 'зс',
//    'ёњ', 'ўк', 'ё∞', 'г»', 'гь', 'Ё¶', 'ёЃ', 'ўд', 'ЏІ', 'ръ', 'уу', 'ф„', 'чњ',
//    'Їу', 'еЋ', '№©', 'ц„', 'тЃ', 'м√', 'йх', 'яь', 'г±', 'дп', 'ас'{, 'хъ'}, 'в©',
//    'мќ', 'р…', 'йќ', 'х≠', 'м≤', 'д∞'{, 'зъ'}, 'ўь', 'б≤', 'вп', 'мж', 'мп', 'уЋ',
//    'ми', 'р≠', 'р„', 'жи', 'оь', 'ил', 'х„', 'вµ', 'д°', 'Ё»', 'пћ', 'еЊ', 'зў',
//    'чя', 'џЉ', 'дљ', 'е’', 'дс', 'цй', 'яІ', 'лЅ', 'Џт', 'бе', 'д“', 'еЎ', 'дк',
//    'иЂ', 'ут'{, 'с•'}, 'у®', 'ць', 'Џґ', 'я‘', 'т≥', 'кЌ', 'зх', 'чв', 'гƒ', 'дІ'{,
//    '№о'}, 'я№', 'дЂ'{, '№ц'}, 'н£', 'ез', 'ає', 'зј', 'ё•', 'у≥', 'г‘', 'в∆', 'Џї',
//    'дг', 'сл', 'пЅ', 'Ўе', 'яЂ', 'оЎ', 'вЈ', 'пм', 'ал'{, 'ёљ'}, 'уґ', 'нє', 'ач',
//    'бб':
//    Result := 'h';
//
//    #0: Result := 'i';
//
//    'ЎҐ', 'яі', 'Ўј', 'зб', '№Є', 'нґ', 'я“', 'Ўё', 'яу', 'ем', 'у«', 'пъ', 'кч',
//    'ке', 'х“', 'з№', 'мі', 'џ‘', 'оњ', 'бІ', 'Ўљ', 'ў•', 'у≈', 'кЂ', 'йк', 'йЃ',
//    'Ёр', 'с§', 'ё™', 'т±', 'ёб', 'к™', 'б’', 'чд', '№Ѕ', 'яв', 'д©', 'кй', 'ў ',
//    'фя', 'х’', 'цЂ', 'цЁ', 'рҐ', 'цк', 'чў', 'жч', 'е»', 'д§', 'зм', 'ри', 'у’',
//    'ф¬', 'Ёз', 'х ', 'пЎ', 'бµ', 'џ£', 'нҐ', 'к©', 'от', 'тћ', 'лќ', 'рэ', 'кІ',
//    'Ё—', 'д’', 'кщ', 'ёц', 'зћ', 'Ёу', 'цд', 'рѕ', 'чµ', 'ао', 'и≈', 'у»', 'х¬',
//    'нъ', 'с–', 'пµ', 'Џў', 'кѓ', 'фе', 'еј', 'ењ', 'кр', 'Џ…', 'й•', 'л¶', 'лм',
//    'ў‘', 'хЁ', '№ь', 'фш', 'з÷', 'нд', 'ср', 'дЃ', 'з≠', 'кс', 'фЁ', '№і', 'жѓ',
//    '№ъ', 'т‘', 'х”', 'ў’', 'цё', 'р‘', 'ўЃ', 'ёЎ', 'р®', 'лЄ', 'би', 'аЁ', 'хі',
//    'р№', 'аЃ', 'аµ', 'жЁ', 'Џ¶', 'Џµ', 'ё„', 'ио', 'жЉ', 'т°', 'нў', 'цЏ', 'ф…'{,
//    'тї'}, 'чЇ', 'оƒ', 'сж', 'с∆', 'Џб', 'Ёј', 'вџ', 'вЋ'{, 'й»'}, 'и™', 'ж°', 'Ё£',
//    'кб', 'з∆', 'ко', 'ад', 'гю', 'мЇ', 'ЁЉ', 'лж', 'Џе', 'Ўў'{, 'л¬'}, 'ў”', 'гљ',
//    'ет', 'е…', 'л÷'{, 'жЇ'}, 'в∞', 'мз', 'еƒ', 'рѓ', 'фс', 'гќ', 'а±', 'чЁ', 'и—',
//    'ик', 'аў', 'жё', 'зе', 'б»', 'иц', 'хы', 'Ў ', 'Ўг', 'Џ№', 'в±', 'ёІ', 'й”',
//    'пг', 'хк', 'џ«', 'мя', 'сд', 'уё', 'че', 'ё№', 'жщ', 'џ»', 'ў÷', 'р’', '№Џ',
//    'ёд', 'йІ', 'иҐ', 'пЄ', 'с’', 'ц¬', 'чґ', '№м', 'йЈ', 'й∞', 'ці', 'хб', 'Џ™',
//    '№ƒ', 'о“', 'ў∆', 'кш', 'мЂ', 'сј', 'ер', 'еб', 'хґ', 'дЄ', 'п‘', 'о√', 'п√',
//    'ир', 'бъ', 'цЅ', 'џ≤':
//    Result := 'j';
//
//    'т¬', 'я«', 'Ўы', 'лћ', 'пі', 'Ў№', 'џо', 'вэ', 'ош', 'Ё№', 'п«', 'вй', 'ни',
//    'кђ', 'ў©', 'Ё®', 'гџ', 'оЂ', 'Ўш', 'г ', 'о÷', 'ек', 'иа', 'он', 'кы', 'зж',
//    'йр', 'рв', 'оЁ', 'т§', 'пэ', 'сљ', 'оІ', 'тт', 'чЅ', 'б≥', 'г°', 'лі', 'жм',
//    'зЉ', 'аЊ', 'дџ', 'пЊ', 'сћ', 'пђ', 'ў≈', 'б«', 'ун', '№“', 'но', 'яµ', 'уЎ',
//    'ёҐ', 'ЎЏ', '№•', 'чЉ', 'зЂ', 'аЈ', 'ў®', 'Ўб', 'џ¶', 'яа', 'бц', 'лЏ', 'ч≈',
//    'Џ≤', 'я—', 'Џњ', 'ё≈', 'Џч', 'џџ', 'жю', 'к№', 'г¶', 'е”', 'ЎЄ'{, 'а≠'}, 'ёс',
//    'к“', 'о•', 'тс', 'ўз', 'хЌ'{, 'Ў—'}, 'а∞', 'гі', 'Ёё', 'ус', 'сщ', 'зы', 'пњ',
//    'ч’', 'хЂ', 'цп', 'гІ', 'гЌ', 'ий', 'т“':
//    Result := 'k';
//
//    'ўы'{, 'ц¶'}, 'ее', 'кє', 'н«', 'ЎЁ', 'рш', 'бЅ', 'бв', 'дµ', 'п™', 'кг', 'нщ',
//    'дю', 'сЃ', 'ф•', 'б∞', 'с№', 'мµ', 'пз', 'й≠', 'дн', 'ољ', 'а•'{, 'Ёє'}, 'пь',
//    'пґ', 'тл', 'гѕ', 'Ёх', 'ял', 'бј', 'рм', 'п©', 'х≤', 'иб', 'оо', 'см', 'Ўм',
//    'яЈ', 'го', 'ч¶', 'ж–'{, 'з–'}, 'йџ', 'ўъ', 'сз', 'Џ≥', 'х™', 'аѕ', '№®', 'гґ',
//    'жк', 'ађ', 'рњ', 'з ', 'Ёс', 'тџ', 'жЋ', 'цв', 'оЊ', 'ёЉ', 'чу', 'уї', 'ўµ',
//    'ж≤', 'еќ', 'пЃ', 'еҐ', 'хЈ', 'чѓ', 'яњ', 'џё', '№¬', 'ме', 'иј', 'рЁ', 'ў≥',
//    'иЁ', 'ря', 'йц', 'џ™', 'бы', 'н¬', 'Ё∞', 'а¶', 'у“', 'фѕ'{, 'т√'}, 'оЇ', 'х»',
//    'ц®', 'да', 'уц', 'ё∆', 'сЌ', 'цг', 'е•', 'м°'{, 'ує'}, 'зц', 'сѕ', 'Ёь', 'жЃ',
//    'йз', 'йђ', 'дт', 'й£', '№Ѓ', 'х‘', 'чЋ', 'аЏ', 'еЉ', 'в≤', 'з‘', 'р”', 'о…'{,
//    'ё§'}, 'ёЌ', 'я÷', 'ўэ', 'д£', 'џш', 'ёж', 'фу', 'хс', 'ча'{, 'яш'}, 'ф‘', 'б„',
//    'еа', 'к•', 'ођ', 'чл', 'вё', 'гЅ', 'йЁ', 'Ёю'{, 'мҐ'}, 'хп', 'ат', 'гц'{, '№я'},
//    'иЏ', 'к≤', 'ищ', 'з±', 'фб', 'сц', 'т»', 'цм', 'џє', 'я ', 'м÷', 'дѓ', 'мЉ',
//    'её', 'жт', 'п÷', 'цћ', 'зЄ', 'п≥', 'р“', 'гс', '№„', 'и–', 'зз', 'л ', 'н√'{,
//    'с™'}, 'џв', 'ўЌ'{, 'ўЌ'}, 'аґ', 'Ёд', 'сп', 'тч', 'ч√', 'б–', 'рь', 'пќ', 'аа',
//    'я£', 'џд', 'гт', 'и”', 'лЌ', 'йс', 'рµ', 'фµ', 'ц‘', 'й÷', 'пе', 'йы', 'дЋ',
//    'е÷', 'дх', 'к§', 'иі', 'уь', 'рЎ', 'л™', 'гћ', 'йµ', 'пщ':
//    Result := 'l';
//
//    'лц', 'сЏ', 'ип', 'рљ', 'ўх', 'ц«', 'п≤', 'ар', 'ёџ', 'в§', 'лб', 'й°', 'пЁ',
//    'ўј', 'сІ', 'ўщ', 'гш', '№э', 'зу', 'ёы', 'др', 'ц√', 'яЉ', 'ж÷'{, 'у°'}, 'бп',
//    'ињ', 'яй', 'ц≤', 'Ё§', 'џљ', 'т©', 'чі'{, 'ч©'}, 'тэ', '№ђ', 'б£', 'зѕ', 'м„',
//    'п№', 'Џш', 'нЋ', 'дЁ', 'тю', 'ку', 'мЄ', 'т÷', 'ч÷'{, 'тъ'}, 'у±', 'бє', 'гч',
//    '№в', 'кƒ', 'л£', 'ўу', 'и£', 'о¶', 'нЃ'{, 'ЁЃ'}, 'б“', 'дЎ', 'в≠', 'йє', 'п—',
//    'рћ', 'дЉ', 'с«', 'ч»', 'ё—', 'оЌ', 'мЋ', 'нѓ', 'тµ', 'Ёщ', 'ёЂ', 'ль', 'нж',
//    'фњ', 'џ¬', 'фї', 'тм', 'г¬', 'уЈ'{, 'яд'}, 'мт', 'в®', 'чг', 'чз', 'ё¬', 'Ў¬',
//    'еф', 'фЌ', 'ля', 'фй', 'ги', 'еµ', 'Џ„'{, 'а„'}, 'гж', 'цЉ', 'нн', 'дѕ', 'лп',
//    'яч', 'р≈', 'и¬', 'нр', 'нµ', 'зњ', 'ег', 'яг', 'уъ', 'уЇ', 'бЇ', 'зд', '№е',
//    'зл', 'з≈', 'г…', 'гэ', 'н™', 'ч™', '№ш', 'Џ§', 'дй', 'к‘', 'о®', 'х§', 'з—',
//    'Џ”', 'ж∆', 'в…', 'чб', 'йв'{, '№‘'}, 'пч', 'Ёл', 'хц', 'сҐ', 'п“', 'хш', 'ст',
//    'яи', 'ў∞', 'нш', 'ц ', 'л§', 'Ўп', 'ге', 'џй', '№ў', 'ов', 'д≈':
//    Result := 'm';
//
//    'ё÷', 'ё√', 'Ўњ', 'п’', 'л«', 'сƒ', 'ёа', '№µ', 'иЌ'{, 'ЁЅ'}, 'ЎЊ', 'ап'{, 'аЂ'},
//    'й™', 'фц', 'ло', 'тп', 'ам', 'вќ', 'кў', 'я≠', 'ЎЂ', 'яќ', 'н–', 'оу', 'вЃ',
//    'тЌ', 'џс', 'иІ', 'ЏЂ', 'џи', 'вх', 'ок', 'в•', 'цт', 'ў£', 'мї', 'к«', 'ню',
//    'ц”', 'цу', 'р§', 'йэ', 'Ў•', 'џю', '№а', 'фЅ', 'ж’'{, 'ле'}, 'Џн', 'фЂ', 'ањ',
//    'т®', 'хж', 'ёЅ', 'яћ', 'сч', 'Ўъ', 'еЄ', 'ж§', 'во', 'бр', 'ўѓ', 'яж', 'сс',
//    'жџ', 'же', 'еу', 'жј', 'оѕ', 'н§', 'фђ', 'ў–', 'яц', 'ёщ', 'пї', 'н•':
//    Result := 'n';
//
//    'аё', 'Џ©', 'к±', 'со', 'вж':
//    Result := 'o';
//
//    'оў', 'ё’', 'бЁ', 'ЏҐ', 'Ёв'{, 'иЋ'}, 'уб', 'ўљ'{, 'яя'}, 'Ёе', 'гЁ', 'хз', 'уі'{,
//    'гъ'}, 'с»', 'сб', 'ди', 'ећ', 'у¶', 'лг', 'в“', 'бу', 'ёЋ', 'ре', 'хђ', 'п¬',
//    'аъ', 'мЈ', 'аќ', 'цђ', 'д‘', 'вс', 'аЎ', '№°', 'у≤', 'ЎІ', 'зҐ', 'Џь', 'ол',
//    'аи', '№≈'{, 'иЅ'}, 'тЈ', 'џѓ', 'Џр', 'џэ', 'оЉ', 'тз', 'хщ', '№±', 'вѕ', 'Ўт',
//    'џ№', 'я®'{, 'с±'}, 'дƒ', 'ж«', 'оҐ', 'кґ', 'къ', 'фж', 'жй', 'лЁ', 'хд', 'Џ“',
//    'Ўв', 'зќ'{, 'у™'}, 'йи', 'о©'{, 'а—'}, 'жќ', 'л≠', 'Ўѓ', '№÷', 'ж∞', 'ж…', 'т≠',
//    'йѓ', 'кт', 'ж≥', 'ўЈ', 'и“', 'ц“', 'о«', 'џґ', 'рЂ', 'Ўѕ', 'оё', 'уЌ'{, 'зк'},
//    'ёе', 'ўц', 'кЈ', 'аџ', 'ўй', 'и±', 'еІ', 'пд', 'дя', 'лЂ', 'пи', 'хл', 'Ў÷',
//    'ва', 'ёћ':
//    Result := 'p';
//
//    'Ўќ', 'с ', 'д–', 'бљ', 'фт'{, 'цƒ'}, 'из', 'Ё¬', 'а“', 'й ', 'хи', 'ЎЅ', 'џя',
//    'б™'{, '№ќ'}, 'к»', 'сэ', 'дњ', 'Ёљ', 'жл', 'зщ', 'зч', 'мч', 'т”', 'фл', 'та',
//    'ё≠', 'чҐ', 'чи', 'б®', '№ї'{, 'иљ'}, 'з≤', 'фм', 'га', '№щ', 'ЁЁ', 'н”', 'нђ',
//    'Ё÷', 'чƒ', 'Џд', '№Ј', 'ўЁ', 'б©', 'г•', 'н©', 'еє', 'еЇ', 'ељ', 'о‘', 'тѓ',
//    'ёз', 'уй', 'л…', 'гї', 'з„', '№Ќ', '№з', 'ўї', 'иэ', 'гё', 'к®', 'хƒ', 'тё',
//    'пЇ', 'пѕ', 'пк', 'жЌ', 'й…'{, 'ф«'}, 'ся', 'мЅ', 'нЌ', 'хќ', 'Ўд', 'зЎ'{, '№с'},
//    'Џџ', 'гЊ', 'ч≥', 'й‘', 'гЄ', 'Џљ', 'ж™', 'кь', 'гЂ', 'уж', 'п∆', 'фј'{, '№Ћ'}{,
//    'аЇ'}, 'дЏ', 'ая', 'й’', 'ты', 'пЈ', 'яƒ', 'ём', 'ах', 'тя', 'цл', 'й—', 'чф',
//    '№№', 'ц•', 'уд', 'на', 'уј', 'хЉ', 'ц∆', 'Џц', 'сЈ', '№д', 'ућ', 'тЋ', 'т«',
//    'й±', 'цъ', 'бм', 'т∞', 'ўі', 'еѕ', 'кд'{, 'џѕ'}, 'еў', 'ф√', 'тш', 'чь', 'ф№',
//    'бЂ', 'Џ∞'{, 'мо'}, 'т–', 'фр', 'чс', 'џЊ', 'л‘', 'рґ', 'ё°', 'нб', 'и≥', 'ёЊ',
//    'лђ', 'с≥', 'бй', 'уљ', 'г÷', 'кп', 'г™', 'Џє', '№х', 'йъ', 'оэ', 'у№', 'тй',
//    'ч№', 'о∞', 'зє', 'н®', 'г„', 'гЏ', 'е“', 'џІ'{, 'пк'}:
//    Result := 'q';
//
//    'т≈'{, 'ч„'}, '№џ', 'мь', 'р¶', '№й', 'иг', 'жђ', '№у', 'пю', 'Ўр', 'йн', 'вњ',
//    'с≈', 'лј', 'бх', 'б…', 'й≈', 'то', 'фџ', 'хе', 'чЈ', 'п®', 'ай', 'е¶', 'ёЄ',
//    'са', 'тђ', 'д≤', 'дб', 'з»', 'Ёк', 'л√', 'ё®', '№«', 'иƒ', 'тЄ', 'о£', 'ўЉ',
//    'уи':
//    Result := 'r';
//
//    'мб', 'иЉ', 'Ў≠', 'џ…', 'ЁЎ', 'Ўн', 'Ў¶', 'м™', 'лџ'{, 'аз'}, 'лІ', 'ф÷', 'вћ',
//    'ёъ', 'ня', 'т™', 'з“', 'лэ', 'цю', '№£', 'рю', 'Ўƒ', 'п§', 'р£', 'п°'{, 'рр'},
//    'фƒ'{, 'ци'}, 'яю', 'м¶', 'цЃ', 'бк', '№ѕ', 'ж©', 'оћ', 'џп', 'фЃ', 'х«', 'дъ',
//    'лю', 'Џ®', 'рё', 'жу', 'џЈ', 'ж”', 'уµ', 'ч≠', 'йд', 'хь', 'мЎ', 'џр', 'зі',
//    'ув', 'фє', 'тў', 'џњ', 'ды', 'в¶', 'оі', 'ў№', 'Ў«', 'д№'{, 'чк'}, 'ЏЈ', 'я”',
//    'пт', 'Џ≈', 'д…', 'лѕ', 'й©', 'т„', 'уѕ', 'нт', 'к…', 'б”', 'Ёй', 'хІ', 'цх',
//    'вї', 'м¬', 'џх', 'Ё™', 'це', 'хє', 'мк', 'кџ', 'у¬', 'йш', 'ож', 'я±', 'Џ÷',
//    'уя', 'уІ', 'фЉ', 'бч', 'зЈ', 'мѓ', 'з£', 'ж≠', 'ўњ', 'Ёƒ', 'ёу', 'л®', 'пш',
//    'џ”', 'гр', 'лт', 'дш', 'аІ', 'у∞', 'г≈', 'дћ', 'ж„', 'гя', 'ещ', 'ое', 'а ',
//    'ёч', 'Ёф', 'й√', 'џћ', 'я–', 'рЄ', 'зЅ', 'тѕ', 'ЎЋ', 'п»', 'дщ', 'гб', 'ўо',
//    'ж¶', 'мл', 'гф', 'жб', 'ўє', 'у”', 'ск', 'вм', 'Џ°', 'б¬', 'дЅ', 'Ёњ', 'б‘',
//    'мЁ', 'ед', 'бш', 'Ё•', 'вЄ', 'цј', 'йЊ', 'жґ', 'кэ'{, 'кэ'}{, 'кэ'}, 'иш', 'нь',
//    'а¬', 'яп', 'ЁЈ', 'г§', 'сµ', 'а≤', 'д—', 'в»', 'мђ', 'пЋ', 'тф', 'џ≈', 'а’',
//    'о§', 'ёі', 'ц’', 'ўн', 'д≥', 'Џ’', 'аЉ', 'гЇ', 'Ёш', 'цҐ', 'ущ', 'в°', 'Ёі',
//    'нх', 'о°', 'е°', 'Џ«':
//    Result := 's';
//
//    'н≥', 'яЊ', 'мв', 'о„', 'Ўз', '№ж', 'ё–', 'хЅ', 'ои', 'дв', 'ч£', 'гЋ', 'еЁ',
//    'йљ', 'жж', 'џҐ', 'м∆', 'хћ', 'цЎ', 'ёЈ'{, 'лƒ'}, 'о—', 'кЉ', 'џ∞', 'сы', 'пƒ',
//    'мю', 'ог', 'п¶', 'ф ', 'пџ', 'вЉ', 'дз', 'и©', 'йћ', 'у•', 'уЂ', 'х±', 'аы',
//    'ўќ', 'сн', 'иЇ', 'ч“', 'дђ', 'яы', 'Ўї', 'мэ', 'яѓ', 'пЂ', 'нЂ', 'лш', 'з∞',
//    'зЊ', 'р√', 'хЃ', 'ў√', 'г©', 'е—', 'с”', 'о±', 'гў', 'г√', 'йе', 'ёЁ', 'ўђ',
//    'мц', 'у‘', 'цґ', 'ти', 'чЎ', 'цж', 'сї', 'ф–', 'Ё∆', 'ч—', '№р', 'ж√', 'Ёг',
//    'т—', 'ц™', 'ии', 'аћ', 'ўЏ', 'ў°', '№н', 'н≈', 'ў„', 'дь', 'въ', 'чї', 'Ё±',
//    'х©', 'о ', '№Ґ', 'ЁЋ', 'ё“', 'оґ', 'еи', 'м’', 'к’', 'вљ', 'ла'{, 'ўџ'}, 'Ў±'{,
//    'ўҐ'}, 'џз', 'гы', 'иё', 'н»', 'х…', 'хҐ', 'й“', 'цЊ', 'в’', 'иЎ', 'ук':
//    Result := 't';
//
//    'ўп', 'жі', 'Ўф', 'лр', 'бЋ', 'Ўа', 'тк', 'жэ', '№є', 'зЇ', 'лд', 'Ё“', 'зю',
//    'оµ', 'Ўи', 'гѓ', 'йю', 'чЌ', 'ўЋ', 'е‘', 'Џс', 'ЁЏ', 'м–', 'ё±', 'ан', 'аш',
//    'гн', 'г«', 'дґ', 'б°', 'бЌ', 'мњ', 'зв', 'дҐ', 'жЄ', 'Џ√', 'Џу', 'вЂ', 'рф',
//    'фЇ', 'иЄ', 'цџ', 'к¶', 'вђ', 'г”', 'ц©', 'ЎЎ', 'гл', 'иЈ', 'Ёо', 'ё≥', 'ўЅ',
//    'ЁЂ', 'аЄ'{, 'лњ'}, 'бҐ', 'д„', 'н“', 'цї', 'џЎ', 'Џщ', 'ді', 'тЏ', 'чщ', 'Ўх',
//    'еь', 'в–', 'ви', 'вд', 'е√', 'кх', 'рƒ', 'Ў£', 'Џг', 'иї', '№ћ', 'м…', 'жƒ',
//    'рн', 'жр', 'еї', 'рЌ', 'ц»':
//    Result := 'w';
//
//    'џ®', 'еж', 'ае', 'Ё°', 'џ„', 'ўв', 'сґ', 'џ≠', 'яс', 'ё…', 'дї', 'м§', 'дј',
//    'ЁЊ', 'ф—', 'фв', 'фЄ', 'р™', 'ў“', 'тб', 'ж“', 'йЎ', 'м®', 'мд', 'фЋ', 'у£',
//    'уђ', 'хµ', 'кЎ', 'чы', 'кк', 'Џф', 'зф', 'бг', 'Ёя', 'еп', 'Ёы', 'мы', 'вЊ',
//    'г“', 'ф™', 'мщ', 'бт', 'и‘', 'нћ', 'еЏ', 'и¶', 'чп', 'уЅ', 'лѓ', 'мм', 'фћ',
//    'Ё≤', 'х—'{, 'х£'}, 'ея', 'жµ', 'рп', 'р¬', 'ўю', 'бэ', 'тє', 'уЏ', 'х–', 'ёЇ',
//    'мё', 'б≠', '№»', 'ц±', '№Љ', 'зљ', 'Ёў', 'жш', 'в‘', 'в√', 'чѕ', 'ця', 'у≠',
//    'и…', 'яЎ', 'и’', 'жз', 'зѓ'{, 'е–'}, 'дм', 'уп', 'чћ', 'б≈', 'уг', 'ў…', 'џƒ',
//    'яҐ'{, 'з”'}, 'ё¶', 'з•', 'ўф', 'дЌ', 'й«', 'йњ', 'вЁ', 'в≥', 'ёѓ', 'ев', 'џ∆',
//    'еђ', 'ху', 'књ', 'мІ'{, '№∞'}{, 'цќ'}, 'Ўґ', 'Џк', 'н ', 'я©', '№ф', 'гђ'{, '№Ї'},
//    'яЁ', 'в”', 'рЉ', 'хч', 'в ', 'чџ', 'бґ'{, 'де'}, 'нм', 'сг', 'зп', 'ЏЉ', 'ит',
//    'фЏ'{, 'хѓ'}, 'д™', 'џ√', 'д”', 'мг', 'ё£', 'Џќ', 'ёп', 'Ёж', 'к—', 'м”', 'ўЎ',
//    'рз', 'дц', 'иѓ', 'гщ', 'м≈', 'оз', 'д÷', 'йЄ', 'нџ', 'па', 'ні', 'хљ'{, 'ч®'},
//    'Џ ', 'џч', 'сњ', 'ві', 'ёє', 'к÷', 'хЄ', 'бЊ', 'вю', 'д≠', 'д±', '№ч', 'ца',
//    'бя', 'ўг':
//    Result := 'x';
//
//    'н±', 'Ўя', 'ив', 'Ўу', 'бђ', 'зр', 'нэ', 'рй', 'е¬', 'џл', 'жЂ', 'нЉ', 'л≤',
//    'ёл', 'вы', 'лў', 'б√', 'Ёќ', 'дќ', 'лз', 'џ≥', 'жћ', 'Џ•', 'г∆'{, 'еы'}, '№Њ',
//    'уџ', 'й№', 'ўр', 'ў≤', 'ў»', 'Ў…', 'џ±', 'зь', 'ої', 'ч ', 'чъ', 'кћ', 'мЌ',
//    'дў', 'х¶', 'ЏЁ', 'ч–', 'ЎЌ', 'гу', 'ч±', 'мЊ', 'ба', 'м»', 'т’', 'ву', 'н¶',
//    'зџ', 'Ў≤', 'яЇ', 'Ў≥', 'л»', 'йч', 'зт', 'бж', 'фн', 'ч•', 'и√', 'сЇ', 'б ',
//    'рќ', 'к„', 'ёё', 'оф', 'Џю', 'к ', 'м«', 'ЏЋ', 'Ўћ', 'с¬', 'яё', 'вҐ', 'м•',
//    'дф', 'аж', 'чр', 'џЁ', 'Џ±'{, 'вщ'}, 'е∆', 'в¬', 'я„', '№и', 'кЁ', 'нф', 'фэ',
//    'рк', 'бЏ', 'о∆', '№”', 'фѓ', 'мљ', 'яЃ', 'Ў„', 'Ўо', 'Ўэ', 'яљ', 'ўЂ', 'бї',
//    'вш', 'жд', 'ё»', 'ёƒ', 'фа', 'йу', 'г®', 'ёЏ', 'џь', 'сі', 'зЋ', 'рщ', 'тж',
//    'мЏ', 'п„', 'Ўж', 'йм', 'ё≤'{, 'фи'}, 'сѓ', 'по', '№≤', 'д¶', 'л≥', 'оч', 'а≥',
//    '№І', 'џу', 'бю', 'џі', 'вє'{, 'цЄ'}, 'цѓ'{, 'я≈'}, 'тЊ', 'сЂ', '№б', 'ЎЈ', 'ЁЇ',
//    'зш', 'а”', 'ёь', 'уњ', 'иђ', 'р–', 'вя', '№г', '№ю', 'Ё”', 'йЇ', 'дё', 'Ёц',
//    'дл', 'ўш', 'е≠', 'џЂ', 'т£', 'с®', 'лф', 'а°', 'зя', '№≠', 'гЉ', 'џ’', 'пё',
//    'чЂ', 'бь', 'Џƒ', 'в≈', 'Ё«', 'цІ', 'бќ', 'ён', 'лй', 'и§', 'км', 'св', 'ч”',
//    'аѓ', 'рЃ', 'ўЄ', 'Ўь', 'яѕ', 'и÷', 'ра', 'Ёѓ', 'Ёµ', 'тƒ', 'цѕ', 'йа', 'тц',
//    'Ў’', 'Ёђ', 'ор', 'лї', 'чо', 'ўІ', 'ау', 'еґ', 'т ', 'чш', 'жъ', 'ж•', 'м£',
//    'мґ', 'фІ', 'ЎЃ', 'уƒ', 'ф®', 'сЊ', 'тх', 'Ўс', 'ўґ', 'аф', 'ац', 'в„', 'рх',
//    'сЅ', 'цє', 'н≤', 'еэ', 'вј', 'к≈', 'оЏ', 'ЏЌ', 'г–', 'рЅ', 'мѕ', 'Ёч', 'Ўє',
//    'тв', 'мџ', 'р÷', 'еч', 'р∞', 'ну', 'уо', 'гд', 'лЉ', 'цљ', '№Ђ'{, 'йЏ'}, 'уҐ',
//    'џщ', 'ж¬', 'ёт', 'и•', 'лЊ', 'об', 'й–', 'ўя', 'еЃ', 'з°', '№њ', 'кј', 'лµ',
//    'бс', 'йж', 'џ©', 'гҐ', 'г≥', 'иє', 'мў':
//    Result := 'y';
//
//    'еЅ', 'дЈ', 'Џ¬', 'мъ', 'я™', 'е™', 'пн', 'кя', 'зї', 'Џ—', 'ж№', 'б—', 'ф“',
//    'кҐ', 'хю'{, 'хю'}, 'фф', 'п≈', 'цЈ', 'чЏ', 'цц', 'жҐ', 'пц', 'си', 'у ', 'ич',
//    'ц§', 'нІ', 'нц', 'ўћ', 'ф’', 'жг', 'ЏЅ', 'Џо', 'џЄ', 'цн', 'х°'{, 'а©'}, 'Џв',
//    'я∆', 'ёў'{, 'зё'}, 'бћ', 'фЎ', 'фҐ', 'к√', 'фх', 'ц…', 'иґ', 'к∞', 'жа', 'ё ',
//    'яр', 'е≈', 'ях', 'аэ', 'у–', 'фЈ', 'уе', 'Ў”', 'Ў∆', 'кЊ', 'ЏЏ', 'з’', 'ој',
//    'п≠', 'кµ', 'яЄ', 'яо', 'ёк'{, 'йЂ'}, 'чю', 'нƒ', 'яе', 'рд', 'т∆', 'нќ', 'с©',
//    'мє', 'Џё', 'ёш', 'џµ', 'ж—', 'вѓ', 'и∞'{, 'уѓ'}, 'Ўл', 'б÷', 'б§', 'о»', 'яъ',
//    'Џѓ', 'у…', 'ию', 'тЎ', 'йь', 'ЏЎ', 'я°', 'нЁ'{, 'фч'}, 'сё', 'иѕ', 'р—', 'д•',
//    'ие', 'мх', 'Ёи', 'йї', 'ур', 'л”', 'йф', 'о≥', 'з«', 'р°', 'џЏ', 'р≤', 'лё',
//    'кв', 'бњ', 'оџ', 'п£', 'уЁ', 'бз', 'ЏЇ', 'Ўі'{, 'иў'}, 'му', 'л’', 'џъ', 'фк'{,
//    'х≈'}, 'ёэ', 'х№', '№∆', 'мн', 'ел', 'и„', 'йт', 'нй'{, 'х•'}, 'ве', 'хф', 'ащ',
//    'џ§', 'иќ', 'Џм', 'ид', 'кё', 'йщ', 'рЇ', 'ей', 'рл', 'тќ', 'жп', 'пф', 'лщ',
//    'ц£', 'хў', 'ф±', 'пс', 'уЃ', 'Џ£', 'ха', 'ж®', 'нЎ', 'жы', 'зІ', 'л–', 'ЁІ',
//    'фь', 'ф¶', 'ў™', 'џ•', 'д®', '№п', 'ощ', 'й∆', 'ду', 'йЌ'{, 'у√'}, 'фґ', 'рс',
//    'хо', 'дЊ', 'чж', 'Ўщ', '№—', 'ић', 'мƒ', 'рж', 'уз', 'фг', 'тІ', 'ящ', 'вЌ',
//    'г№', 'цњ', 'жн', 'гЈ', 'зƒ', 'л∆', 'сЄ', 'ўЊ', 'д√', 'нљ', 'Ёѕ', 'пя', 'ўё',
//    'хт', 'зЏ', 'яђ', 'ё©', 'й„', 'чЃ', 'я§', 'Џи', 'вф', 'мс', 'л—'{, 'ят'}:
//    Result := 'z';
//  end;
end;

function GetChinese2PinYinHeader(AChineseString: WideString): AnsiString;  
var  
  CharString: AnsiString;
  headerChar: AnsiString;
  i: Integer;  
begin  
  Result := '';
  for i := 1 to Length(AChineseString) do  
  begin  
    CharString := AChineseString[I];  
    if ByteType(CharString, 1) = mbSingleByte then
    begin
      headerChar := CharString
    end else
    begin
      case Word(CharString[1]) shl 8 + Word(CharString[2]) of
        $B0A1 .. $B0C4: headerChar := 'A';
        $B0C5 .. $B2C0: headerChar := 'B';
        $B2C1 .. $B4ED: headerChar := 'C';
        $B4EE .. $B6E9: headerChar := 'D';
        $B6EA .. $B7A1: headerChar := 'E';
        $B7A2 .. $B8C0: headerChar := 'F';
        $B8C1 .. $B9FD: headerChar := 'G';
        $B9FE .. $BBF6: headerChar := 'H';
        $BBF7 .. $BFA5: headerChar := 'J';
        $BFA6 .. $C0AB: headerChar := 'K';
        $C0AC .. $C2E7: headerChar := 'L';
        $C2E8 .. $C4C2: headerChar := 'M';
        $C4C3 .. $C5B5: headerChar := 'N';
        $C5B6 .. $C5BD: headerChar := 'O';
        $C5BE .. $C6D9: headerChar := 'P';
        $C6DA .. $C8BA: headerChar := 'Q';
        $C8BB .. $C8F5: headerChar := 'R';
        $C8F6 .. $CBF9: headerChar := 'S';
        $CBFA .. $CDD9: headerChar := 'T';
        $CDDA .. $CEF3: headerChar := 'W';
        $CEF4 .. $D1B8: headerChar := 'X';
        $D1B9 .. $D4D0: headerChar := 'Y';
        $D4D1 .. $D7F9: headerChar := 'Z';
      else
        headerChar := GetChinese2PinYinHeaderEx(AChineseString[I]);
      end;
    end;
    if #0 <> headerChar then
    begin
      Result := Result + headerChar;
    end;
  end;  
end;

end.
